posts/2015-01-20-praying-for-enemies.org
#+date: <2015-01-20>
#+filetags: prayer
#+title: Praying for Enemies

Mitch Randall's sermon this Sunday was on loving one's enemies, a notion that I believe is the radically distinctive concept in the ethics of Jesus. This week's prayer:

In this deeply divided world,\\
the best we hope for is\\
tolerance,\\
absence of conflict,\\
live and let live.\\

The path that we have taken\\
is not the way of Jesus,\\
who said,\\
"Love your enemies and\\
pray for those who persecute you."

It's not that I don't pray, Lord.

I pray\\
that they would get what's coming to them,\\
that they would see things my way,\\
that they would realize how wrong they are.

Teach me, Lord,\\
the difference between\\
"praying for"\\
and merely "praying that...."

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]]
#+end_tagline
