docs/posts/2015-01-20-praying-for-enemies.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 31, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Praying for Enemies</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Praying for Enemies</h1>
<p class="subtitle" role="doc-subtitle">Jan 20, 2015</p>
</header><p>
Mitch Randall&rsquo;s sermon this Sunday was on loving one&rsquo;s enemies, a notion that I believe is the radically distinctive concept in the ethics of Jesus. This week&rsquo;s prayer:
</p>

<p>
In this deeply divided world,<br>
the best we hope for is<br>
tolerance,<br>
absence of conflict,<br>
live and let live.<br>
</p>

<p>
The path that we have taken<br>
is not the way of Jesus,<br>
who said,<br>
&ldquo;Love your enemies and<br>
pray for those who persecute you.&rdquo;
</p>

<p>
It&rsquo;s not that I don&rsquo;t pray, Lord.
</p>

<p>
I pray<br>
that they would get what&rsquo;s coming to them,<br>
that they would see things my way,<br>
that they would realize how wrong they are.
</p>

<p>
Teach me, Lord,<br>
the difference between<br>
&ldquo;praying for&rdquo;<br>
and merely &ldquo;praying that&#x2026;.&rdquo;
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orgd1ce64c">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 31, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
